sabre_docs/GetPassengerDataRQ_v4-0-4_Samples/GetPassengerDataRQ_v4-0-1_SamplePayload_4-2-4-1.xml

<SamplePayloads>
<!--Request:-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" xmlns:v4="http://services.sabre.com/checkin/getPassengerData/v4">
   <soapenv:Header>
      <eb:MessageHeader eb:id="" eb:version="1.0" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader">
         <eb:From>
            <eb:PartyId eb:type="URI">Client</eb:PartyId>
         </eb:From>
         <eb:To>
            <eb:PartyId eb:type="URI">Server</eb:PartyId>
         </eb:To>
         <eb:CPAId>IPCC</eb:CPAId>
         <eb:ConversationId>9DB7_921682_1204548352874</eb:ConversationId>
         <eb:Service>GetPassengerDataRQ</eb:Service>
         <eb:Action>GetPassengerDataRQ</eb:Action>
         <eb:MessageData>
            <eb:MessageId>mid:1</eb:MessageId>
            <eb:Timestamp>2008-03-03T12:45:52</eb:Timestamp>
         </eb:MessageData>
      </eb:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
         <wsse:BinarySecurityToken EncodingType="wsse:Base64Binary" valueType="String">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/STSA!ICESMSLB\/STS.LB!-3387380266041269109!83304!0</wsse:BinarySecurityToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <v4:GetPassengerDataRQ validateCheckInRequirements="true" version="4.0.1">
         <!--You have a CHOICE of the next 2 items at this level-->
         <ItineraryAndPassengerInfo>
            <Itinerary>
            <Airline>LA</Airline>
            <!--Optional:-->
            <Flight>129</Flight>
            <!--Optional:-->
            <DepartureDate>2016-07-04</DepartureDate>
            <Origin>ANF</Origin>
         </Itinerary>
            <PassengerList>
               <Passenger>
                    <LastName>HDGLAX</LastName>
                  <!--PassengerID>ED5ADFAE0201</PassengerID-->
               </Passenger>
            </PassengerList>
         </ItineraryAndPassengerInfo>
      </v4:GetPassengerDataRQ>
   </soapenv:Body>
</soapenv:Envelope>

<!--Response:-->

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
   <soap-env:Header>
      <eb:MessageHeader eb:version="1.0" soap-env:mustUnderstand="1" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader">
         <eb:From>
            <eb:PartyId eb:type="URI">Server</eb:PartyId>
         </eb:From>
         <eb:To>
            <eb:PartyId eb:type="URI">Client</eb:PartyId>
         </eb:To>
         <eb:CPAId>IPCC</eb:CPAId>
         <eb:ConversationId>9DB7_921682_1204548352874</eb:ConversationId>
         <eb:Service>GetPassengerDataRQ</eb:Service>
         <eb:Action>GetPassengerDataRS</eb:Action>
         <eb:MessageData>
            <eb:MessageId>f9a0b6dc-5f89-4e95-a040-9fd32274b90b@191</eb:MessageId>
            <eb:Timestamp>2016-07-04T06:28:22</eb:Timestamp>
            <eb:RefToMessageId>mid:1</eb:RefToMessageId>
         </eb:MessageData>
      </eb:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
         <wsse:BinarySecurityToken valueType="String" EncodingType="wsse:Base64Binary">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/STSA!ICESMSLB\/STS.LB!-3387380266041269109!83304!0</wsse:BinarySecurityToken>
      </wsse:Security>
   </soap-env:Header>
   <soap-env:Body>
      <ns3:GetPassengerDataRS xmlns:ns3="http://services.sabre.com/checkin/getPassengerData/v4" xmlns:ns2="http://services.sabre.com/STL/v3">
         <PassengerDataResponseList>
            <PassengerDataResponse>
               <LineNumber>1</LineNumber>
               <LastName>HDGLAX</LastName>
               <FirstName>VRDJ</FirstName>
               <PassengerID>43E2BE8D0001</PassengerID>
               <PNRLocator nameAssociationID="1">DXXRYZ</PNRLocator>
               <BaggageRouteList>
                  <ns2:BaggageRoute>
                     <ns2:SegmentID>1</ns2:SegmentID>
                     <ns2:Airline>LA</ns2:Airline>
                     <ns2:Flight>129</ns2:Flight>
                     <ns2:BookingClass>Y</ns2:BookingClass>
                     <ns2:Origin>ANF</ns2:Origin>
                     <ns2:Destination>SCL</ns2:Destination>
                     <ns2:DepartureDate>2016-07-04</ns2:DepartureDate>
                     <ns2:DepartureTime>07:45AM</ns2:DepartureTime>
                     <ns2:ArrivalDate>2016-07-04</ns2:ArrivalDate>
                     <ns2:ArrivalTime>09:40AM</ns2:ArrivalTime>
                     <ns2:SegmentStatus>HK</ns2:SegmentStatus>
                     <ns2:PassengerID>43E2BE8D0001</ns2:PassengerID>
                     <ns2:HomePrintedBagTag restriction="true">
                        <ns2:ReasonList>
                           <ns2:Reason>!HOME PRINTED BAG TAG NOT ALLOWED AT THIS STATION</ns2:Reason>
                        </ns2:ReasonList>
                     </ns2:HomePrintedBagTag>
                  </ns2:BaggageRoute>
                  <ns2:BaggageRoute>
                     <ns2:SegmentID>2</ns2:SegmentID>
                     <ns2:Airline>LA</ns2:Airline>
                     <ns2:Flight>632</ns2:Flight>
                     <ns2:BookingClass>Y</ns2:BookingClass>
                     <ns2:Origin>SCL</ns2:Origin>
                     <ns2:Destination>LIM</ns2:Destination>
                     <ns2:DepartureDate>2016-07-05</ns2:DepartureDate>
                     <ns2:DepartureTime>03:10PM</ns2:DepartureTime>
                     <ns2:ArrivalDate>2016-07-05</ns2:ArrivalDate>
                     <ns2:ArrivalTime>06:05PM</ns2:ArrivalTime>
                     <ns2:SegmentStatus>HK</ns2:SegmentStatus>
                     <ns2:PassengerID>43E2BE8D0101</ns2:PassengerID>
                     <ns2:BagEmbargo>2</ns2:BagEmbargo>
                  </ns2:BaggageRoute>
                  <ns2:BaggageRoute>
                     <ns2:SegmentID>3</ns2:SegmentID>
                     <ns2:Airline>LA</ns2:Airline>
                     <ns2:Flight>530</ns2:Flight>
                     <ns2:BookingClass>Y</ns2:BookingClass>
                     <ns2:Origin>LIM</ns2:Origin>
                     <ns2:Destination>JFK</ns2:Destination>
                     <ns2:DepartureDate>2016-07-06</ns2:DepartureDate>
                     <ns2:DepartureTime>12:20AM</ns2:DepartureTime>
                     <ns2:ArrivalDate>2016-07-06</ns2:ArrivalDate>
                     <ns2:ArrivalTime>08:55AM</ns2:ArrivalTime>
                     <ns2:SegmentStatus>HK</ns2:SegmentStatus>
                     <ns2:PassengerID>43E2BE8D0201</ns2:PassengerID>
                     <ns2:BagEmbargo>2</ns2:BagEmbargo>
                  </ns2:BaggageRoute>
                  <ns2:BaggageRoute>
                     <ns2:SegmentID>4</ns2:SegmentID>
                     <ns2:Airline>AA</ns2:Airline>
                     <ns2:Flight>942</ns2:Flight>
                     <ns2:BookingClass>Y</ns2:BookingClass>
                     <ns2:Origin>JFK</ns2:Origin>
                     <ns2:Destination>MIA</ns2:Destination>
                     <ns2:DepartureDate>2016-07-06</ns2:DepartureDate>
                     <ns2:DepartureTime>11:10AM</ns2:DepartureTime>
                     <ns2:ArrivalDate>2016-07-06</ns2:ArrivalDate>
                     <ns2:ArrivalTime>02:10PM</ns2:ArrivalTime>
                     <ns2:SegmentStatus>HK</ns2:SegmentStatus>
                     <ns2:PassengerID>43E2BE8D0301</ns2:PassengerID>
                     <ns2:BagEmbargo>2</ns2:BagEmbargo>
                  </ns2:BaggageRoute>
               </BaggageRouteList>
               <PassengerItineraryList>
                  <PassengerItinerary>
                     <SegmentID>1</SegmentID>
                     <Airline>LA</Airline>
                     <Flight>129</Flight>
                     <BookingClass>Y</BookingClass>
                     <Origin>ANF</Origin>
                     <Destination>SCL</Destination>
                     <DepartureDate>2016-07-04</DepartureDate>
                     <AircraftType>763</AircraftType>
                     <Cabin>Y</Cabin>
                     <PassengerType>F</PassengerType>
                     <BagCount>0</BagCount>
                     <TotalBagWeightAndUnit>0</TotalBagWeightAndUnit>
                     <EditCodeList>
                        <ns2:EditCode>OB</ns2:EditCode>
                        <ns2:EditCode>DOCV</ns2:EditCode>
                        <ns2:EditCode>DOCS</ns2:EditCode>
                        <ns2:EditCode>DOCA</ns2:EditCode>
                        <ns2:EditCode>DOCO</ns2:EditCode>
                        <ns2:EditCode>PCTC</ns2:EditCode>
                        <ns2:EditCode>TKT</ns2:EditCode>
                        <ns2:EditCode>M</ns2:EditCode>
                     </EditCodeList>
                  </PassengerItinerary>
                  <PassengerItinerary>
                     <SegmentID>2</SegmentID>
                     <Airline>LA</Airline>
                     <Flight>632</Flight>
                     <BookingClass>Y</BookingClass>
                     <Origin>SCL</Origin>
                     <Destination>LIM</Destination>
                     <DepartureDate>2016-07-05</DepartureDate>
                     <AircraftType>787</AircraftType>
                     <Cabin>Y</Cabin>
                     <PassengerType>F</PassengerType>
                     <BagCount>0</BagCount>
                     <TotalBagWeightAndUnit>0</TotalBagWeightAndUnit>
                     <EditCodeList>
                        <ns2:EditCode>IB</ns2:EditCode>
                        <ns2:EditCode>OB</ns2:EditCode>
                        <ns2:EditCode>DOCV</ns2:EditCode>
                        <ns2:EditCode>DOCS</ns2:EditCode>
                        <ns2:EditCode>DOCA</ns2:EditCode>
                        <ns2:EditCode>DOCO</ns2:EditCode>
                        <ns2:EditCode>PCTC</ns2:EditCode>
                        <ns2:EditCode>TKT</ns2:EditCode>
                        <ns2:EditCode>M</ns2:EditCode>
                     </EditCodeList>
                     <RequiredInfoList>
                        <RequiredInfo>
                           <Code>ESTA</Code>
                           <DetailStatus>ValidationRequired</DetailStatus>
                           <FreeText>!DHS CLEARANCE REQD FOR PASSENGER - USE GDHS ENTRY</FreeText>
                        </RequiredInfo>
                        <RequiredInfo>
                           <Code>DHS</Code>
                           <DetailStatus>ValidationRequired</DetailStatus>
                           <FreeText>!DHS CLEARANCE REQD FOR PASSENGER - USE GDHS ENTRY</FreeText>
                        </RequiredInfo>
                     </RequiredInfoList>
                  </PassengerItinerary>
                  <PassengerItinerary>
                     <SegmentID>3</SegmentID>
                     <Airline>LA</Airline>
                     <Flight>530</Flight>
                     <BookingClass>Y</BookingClass>
                     <Origin>LIM</Origin>
                     <Destination>JFK</Destination>
                     <DepartureDate>2016-07-06</DepartureDate>
                     <AircraftType>787</AircraftType>
                     <Cabin>Y</Cabin>
                     <PassengerType>F</PassengerType>
                     <BagCount>0</BagCount>
                     <TotalBagWeightAndUnit>0</TotalBagWeightAndUnit>
                     <EditCodeList>
                        <ns2:EditCode>IB</ns2:EditCode>
                        <ns2:EditCode>OB</ns2:EditCode>
                        <ns2:EditCode>DOCV</ns2:EditCode>
                        <ns2:EditCode>DOCS</ns2:EditCode>
                        <ns2:EditCode>DOCA</ns2:EditCode>
                        <ns2:EditCode>DOCO</ns2:EditCode>
                        <ns2:EditCode>PCTC</ns2:EditCode>
                        <ns2:EditCode>TKT</ns2:EditCode>
                        <ns2:EditCode>M</ns2:EditCode>
                     </EditCodeList>
                  </PassengerItinerary>
                  <PassengerItinerary>
                     <SegmentID>4</SegmentID>
                     <Airline>AA</Airline>
                     <Flight>942</Flight>
                     <BookingClass>Y</BookingClass>
                     <Origin>JFK</Origin>
                     <Destination>MIA</Destination>
                     <DepartureDate>2016-07-06</DepartureDate>
                     <Cabin>Y</Cabin>
                     <BagCount>0</BagCount>
                  </PassengerItinerary>
               </PassengerItineraryList>
               <RequiredInfoSumList>
                  <RequiredInfo>
                     <Code>ESTA</Code>
                     <DetailStatus>ValidationRequired</DetailStatus>
                     <FreeText>!DHS CLEARANCE REQD FOR PASSENGER - USE GDHS ENTRY</FreeText>
                  </RequiredInfo>
                  <RequiredInfo>
                     <Code>DHS</Code>
                     <DetailStatus>ValidationRequired</DetailStatus>
                     <FreeText>!DHS CLEARANCE REQD FOR PASSENGER - USE GDHS ENTRY</FreeText>
                  </RequiredInfo>
               </RequiredInfoSumList>
               <FreeTextInfoList>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>DOCS</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>P/US/123456789/US/01JAN70/M/01JAN16/HDGLAX/VRDJ</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>DOCA</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>R/US/987 MAIN/EULESS/TX/76040</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>DOCA</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>D/US/123 ANY STREET/ANY TOWN/TX/76052</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>DOCO</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>ORAM UT/V/4298879/PHOENIX/13SEP05/US</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>PCTC</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>/</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
               </FreeTextInfoList>
            </PassengerDataResponse>
         </PassengerDataResponseList>
         <Result messageId="ID-acs-int2-sgdcelab-sabre-com-33065-1467580703695-2-410082" timeStamp="2016-07-04T06:28:22.078Z">
            <ns2:Status>Success</ns2:Status>
            <ns2:CompletionStatus>Complete</ns2:CompletionStatus>
            <ns2:System>ACS-BSO</ns2:System>
         </Result>
      </ns3:GetPassengerDataRS>
   </soap-env:Body>
</soap-env:Envelope>
</SamplePayloads>